[
  {
    "model": "recipebookapp.customuser",
    "pk": 1,
    "fields": {
      "password": "pbkdf2_sha256$720000$CygY0BjC4pN9rzNTBhutTN$g9mO5kgd5eRKRPbWc8+q/Vt+vWtSbFkHg3869nVPY9E=",
      "last_login": "2025-02-07 08:59:07.202250+00:00",
      "is_superuser": true,
      "username": "inna",
      "first_name": "",
      "last_name": "",
      "email": "inna@inna.ru",
      "is_staff": true,
      "is_active": true,
      "date_joined": "2025-01-23 05:46:49.017309+00:00"
    }
  },
  {
    "model": "recipebookapp.recipe",
    "pk": 1,
    "fields": {
      "title": "Сырники из творога",
      "description": "Главный секрет идеальных сырников — а точнее творожников, — творог нужно протереть через мелкое сито и отжать от влаги. Жирность предпочтительна не больше и не меньше 9%. Тесто должно получиться эластичным.",
      "cooking_steps": "Положите весь творог в кастрюльку и разомните его вилкой так, чтобы в нем не осталось крупных комков. Разбейте в него яйца, всыпьте сахар и тщательно все перемешайте. Лучше не использовать слишком сухой или слишком влажный творог, иначе сырники будут разваливаться в процессе приготовления. Всыпьте в творог 5 столовых ложек (с горкой) муки и тщательно перемешайте. Можно добавить немного больше муки, сырники получатся тогда более плотными. Или муки можно добавить чуть меньше, и тогда сырники будут нежнее. В итоге у вас должна получиться однородная масса, из которой можно будет лепить сырники. Поставьте сковороду на средний огонь и налейте в нее подсолнечное масло. Насыпьте на тарелку немного муки. Слепите несколько небольших шариков из получившейся творожной массы и положите их на тарелку. Лучше лепить разом 4–5 шариков — столько, сколько поместится одновременно на сковороду. Затем по очереди обкатывайте творожные шарики в муке, плющите их в небольшие лепешки (они не должны быть слишком тонкие) и выкладывайте на сковороду.",
      "cooking_time": "01:30:00",
      "image": "recipes/kak-prigotovit-vkusnye-syrniki.webp",
      "entry_date": "2025-01-23 05:50:49.126972+00:00",
      "is_visible": true,
      "author_id": 1,
      "meal_type": "breakfast"
    }
  },
  {
    "model": "recipebookapp.recipe",
    "pk": 2,
    "fields": {
      "title": "Блины на молоке: традиционный рецепт",
      "description": "Традиционный рецепт блинчиков",
      "cooking_steps": "Размешайте яйца с солью и сахаром (венчиком или миксером).\r\nВлейте молоко (желательно слегка тёплое, или комнатной температуры).\r\nПонемногу добавляя просеянную муку, перемешайте блинное тесто венчиком, чтобы добиться однородной консистенции без комочков.\r\n\r\nФото приготовления рецепта: Блины на молоке: традиционный рецепт - шаг №2\r\nТесто для блинов должно быть достаточно жидким, чтобы блинчики получались тонкими.\r\nВлейте в тесто растительное масло. Перемешайте.\r\n\r\nФото приготовления рецепта: Блины на молоке: традиционный рецепт - шаг №3\r\nХорошо разогрейте сковороду и слегка смажьте её маслом.\r\n\r\nФото приготовления рецепта: Блины на молоке: традиционный рецепт - шаг №4\r\nНалейте в центр сковороды небольшую порцию теста. Сразу же вращайте сковородку по кругу, чтобы тесто равномерно распределилось по всей поверхности.\r\n\r\nФото приготовления рецепта: Блины на молоке: традиционный рецепт - шаг №5\r\nЖарьте тонкие блины на среднем огне до зарумянивания с двух сторон. Переворачивайте блинчики аккуратно с помощью лопатки.\r\nГотовые блины сразу смазывайте сливочным маслом, чтобы края не были сухими и блинчики получились нежными.\r\n\r\nФото приготовления рецепта: Блины на молоке: традиционный рецепт - шаг №6\r\nБлинчики можно подавать с вареньем, джемом или сгущенкой.\r\nПриятного аппетита!",
      "cooking_time": "01:10:00",
      "image": "recipes/fb9a99b6-12c9-525d-806c-7a6b2ce5c01e.jpg",
      "entry_date": "2025-01-24 15:27:57.649717+00:00",
      "is_visible": true,
      "author_id": 1,
      "meal_type": "breakfast"
    }
  },
  {
    "model": "recipebookapp.recipe",
    "pk": 3,
    "fields": {
      "title": "Печенье песочное",
      "description": "Мало есть на свете более позитивных, надежных и успокаивающих нервы вещей, чем запах горячего печенья, постепенно наполняющий кухню.",
      "cooking_steps": "В муку положить сахарный песок, соду, ванилин, все перемешать, добавить сметану, масло кусочками и замесить тесто.\r\nЧтобы раскатать большой лист теста, скалка должна быть длинной. С ней также удобнее будет проделать фокус, позволяющий сделать толщину листа равномерной: тесто повесить на скалку и повращать вокруг нее в воздухе. \r\nСкатать тесто в шар, обернуть пленкой и убрать в холодильник на 20–30 минут.\r\nНа подпыленной мукой поверхности раскатать тесто толщиной около 1/2 см. На поверхности теста сделать наколы вилкой и вырезать фигурки. Выложить на противень. Некоторые фигурки можно украсить, например в центре кружка положить изюминку или ягодку из варенья.  \r\nФигурки смазать взбитым яйцом и поставить в духовой шкаф, разогретый до 170 градусов, на 10–12 минут.",
      "cooking_time": "01:30:00",
      "image": "recipes/pechene-pesochnoe_15281_photo_155775.webp",
      "entry_date": "2025-01-29 07:14:15.703237+00:00",
      "is_visible": true,
      "author_id": 1,
      "meal_type": "breakfast"
    }
  },
  {
    "model": "recipebookapp.recipe",
    "pk": 4,
    "fields": {
      "title": "Азу по-татарски",
      "description": "А что готовят на ужин своим внукам татарские бабушки, да еще если мороз за окном? Конечно же, азу по-татарски!",
      "cooking_steps": "Для приготовления азу по-татарски, если, конечно, Вы не татарская Бабушка, а она и так знает, что и как нужно делать, Вам потребуется: топленое масло, мясной бульон, мясо (говядина или баранина), картофель, репчатый лук, соленые огурцы, помидоры (рубленые томаты в собственном соку или томатная паста), смесь перцев, соль.\r\n\r\nЛук почистить и нарезать полукольцами или четверть-кольцами.\r\n\r\nСоленые огурцы, лучше всего бочковые, очистить от кожицы и нарезать небольшими брусочками, толщиной в 3-4 миллиметра.\r\n\r\nМясо (я использовал говяжью голяшку) нарезать продолговатыми кусочками, размером примерно с большой палец руки.\r\n\r\nХорошенько разогреть казан и в топленом масле частями обжарить мясо. На сильном огне, до корочки – мясо ни в коем случае не должно пустить сок.\r\n\r\nПереложить готовое мясо в чистую тарелку и отставить в сторонку.\r\n\r\nДобавить в казан еще немного топленого масла и обжарить лук, который заодно снимет со стенок казана все мясные прижарки. А аромат жареного лука так и будет витать по дому, заставляя домочадцев томиться в предвкушении трапезы.\r\n\r\nПереложить мясо обратно, в казан. Посолить, приправить свежемолотой смесью перцев и хорошенько перемешать.\r\n\r\nДобавить рубленные томаты в собственном соку, или свежие помидоры, предварительно очищенные и измельченные.\r\n\r\nПеремешать и готовить несколько минут, не накрывая крышкой, чтобы выпарилась лишняя влага из помидоров и появился красивый, насыщенный томатный цвет.\r\n\r\nВлить в казан мясной бульон, перемешать и оставить тушиться под крышкой, на медленном огне, почти до полной готовности мяса. У меня на это ушло 45 минут.\r\n\r\nТем временем, нарезанные соленые огурцы, переложить в кастрюльку и припустить в небольшом количестве бульона.\r\n\r\nТеперь, нужно почистить картошку, нарезать её брусочками и обжарить в топленом масле, почти до полной готовности.\r\n\r\nСамое время проверить готовность мяса, выправить вкус на соль и скорее всего на сахар, если используются свежие помидоры.\r\n\r\nПереложить в казан подготовленные картошку и соленые огурцы. Аккуратно но тщательно перемешать и накрыв крышкой, оставить томиться на самом малом огне, еще 10-15 минут.\r\n\r\nПока азу томится на плите, как раз можно порубить зелень (петрушка, кинза) с чесноком, достать свежие лепешки и заварить чай.\r\n\r\nДа-да, можно и не чай, под такое блюдо – совсем не грех! Ашларыгыз тәмле булсын! Приятного аппетита!",
      "cooking_time": "02:00:00",
      "image": "recipes/bb9148404e5025e8ed5961ad37e469f8.jpg",
      "entry_date": "2025-02-02 15:36:11.893529+00:00",
      "is_visible": true,
      "author_id": 1,
      "meal_type": "breakfast"
    }
  }
]